test/request-response-samples/Dummy__should_ignore_custom_defined_namespaces/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
		<ns1:DummyRequest xmlns:ns1="http://www.Dummy.com/Name/Types">
            <ns1:DummyField1>Humpty</ns1:DummyField1>
            <ns1:DummyFilter>
                 <ns2:DummyStringFilter xmlns:ns2="http://www.Dummy.com/Common/Types">Dumpty</ns2:DummyStringFilter>
            </ns1:DummyFilter>
            <DummyAccount>
            <DummyName>Dummy</DummyName>
            <DummyPassword>1234</DummyPassword>
            </DummyAccount>
        </ns1:DummyRequest>
</soap:Body>
</soap:Envelope>